<a href="https://colab.research.google.com/github/yoonyoung27/prac_class/blob/main/tidyverse_prac2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
library(tidyverse)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.3.3     ✔ purrr   0.3.4
✔ tibble  3.1.0     ✔ dplyr   1.0.5
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

#Tidyr
a package for data cleaning (most built-in R functions work with vectors of values)

#####* Rule for tidy data

* Every column is variable
* Every row is an observation
* Every cell is a single value

#①Pivoting

#①.1 pivot_longer()

###table4a, table4b
The dataset on which one variable is spread across multiple columns

In [ ]:
table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [ ]:
table4b

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

In [ ]:
help(pivot_longer)

In [ ]:
tidy4a <- table4a %>%
pivot_longer(c('1999', '2000'), names_to = "year", values_to = "cases")
tidy4a

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [ ]:
tidy4b <- table4b %>%
pivot_longer(c('1999', '2000'), names_to = "year", values_to = "population")
tidy4b

  country     year population
1 Afghanistan 1999   19987071
2 Afghanistan 2000   20595360
3 Brazil      1999  172006362
4 Brazil      2000  174504898
5 China       1999 1272915272
6 China       2000 1280428583

In [ ]:
?left_join
left_join(tidy4a, tidy4b)

Joining, by = c("country", "year")

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

* __<left_join(x,y)>__ Add columns from y to x matching rows based on the keys of x

#①.2 pivot_wider()

###table2
The dataset on which one observation is scattered across multiple rows

In [ ]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

In [ ]:
help(pivot_wider)

In [ ]:
table2 %>%
pivot_wider(names_from = type, values_from = count)

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

#② Seperating and uniting

#②.1 seperate()

###table3
The dataset on which one column contains two variables

In [ ]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [ ]:
help(separate)

* __<[^[:alnum:]]+>__ One kind of regular expression. Any string that are not numbers

In [ ]:
table3 %>%
separate(rate, into = c("cases", "population"), sep="/") %>%
mutate(cases = as.numeric(cases), population = as.numeric(population))

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

* seperate()를 사용하면 해당 데이터 유형은 character이다

#②.2 unite()

### table5
the dataset on which single variable is spread across multiple columns

In [ ]:
table5

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [ ]:
help(unite)

In [ ]:
table5 %>%
unite(new, century, year, sep = "")

  country     new  rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

#Purrr
a package for looping patterns over a vector

#① map()

In [ ]:
?map()

df %>% map(mean)
# df %>% map(~mean(.)) ; 위와 같은 식
df %>% map_dbl(mean)

$a
[1] 0.108561

$b
[1] -0.3052299

$c
[1] 0.1980162

$d
[1] 0.1006173

         a          b          c          d
 0.1085610 -0.3052299  0.1980162  0.1006173

* __<~ftn(.)>__ put the vector of df in the location of .
* output
 * map() output as a list
 * map_lgl() output as a logical vector
 * map_int() output as an integer vector
 * map_dbl() output as a double vector
 * map_chr() output as a character vector

In [ ]:
f1 <- function(df) {
    lm(mpg ~ wt, data = df)
    }
mtcars %>%
split(.$cyl) %>%
map(f1)

#mtcars %>%
#split(.$cyl) %>%
#map(function(df) lm(mpg ~ wt, data = df)) ; 위와 같은 식

#mtcars %>%
#split(.$cyl) %>%
#map(~lm(mpg ~ wt, data = .)) ; 위와 같은 식

mtcars %>%
split(.$cyl) %>%
map(~lm(mpg ~ wt, data = .)) %>%
map(summary) %>%
map_dbl(~.$r.squared)

#mtcars %>%
#split(.$cyl) %>%
#map(~lm(mpg ~ wt, data = .)) %>%
#map(summary) %>%
#map_dbl('r.squared') ; 위와 같은 식

x <- list(list(1, 2, 3), list(4, 5, 6), list(7, 8, 9))
x %>% map_dbl(2)

$`4`

Call:
lm(formula = mpg ~ wt, data = df)

Coefficients:
(Intercept)           wt
     39.571       -5.647


$`6`

Call:
lm(formula = mpg ~ wt, data = df)

Coefficients:
(Intercept)           wt
      28.41        -2.78


$`8`

Call:
lm(formula = mpg ~ wt, data = df)

Coefficients:
(Intercept)           wt
     23.868       -2.192

        4         6         8
0.5086326 0.4645102 0.4229655

[1] 2 5 8

* 응용
 * define a function in a map function
 * extract a component

#* for_loops
###3 components
* The output

>allocate sufficient space for the output

* The sequence

>what to loop over

* The body

>the code that does the work

###Example data

In [ ]:
df <- tibble(
    a = rnorm(10),
    b = rnorm(10),
    c = rnorm(10),
    d = rnorm(10)
    )
class(df)
df

[1] "tbl_df"     "tbl"        "data.frame"

   a          b          c          d
1  -0.8091547 -1.4926998 -0.1539209  0.7333885
2   0.7819028 -0.4661417  0.6101357  2.5378040
3   1.9878210 -2.0682077 -0.9086720 -0.6492723
4  -0.7464279  0.1968621  0.2837478 -0.8803042
5  -0.9640951  0.2871942  0.8387172  0.2735685
6  -0.5729058 -1.0945172 -0.8920093 -1.3029256
7   2.1272283  0.4086188 -0.3125696 -0.4849972
8  -0.3515866 -0.2469558  1.0372024  0.3029632
9   0.8295511  1.1696703  1.9819075 -0.2291312
10 -1.1967233  0.2538781 -0.5043762  0.7050789

* __<rnorm(n)>__ n random numbers from normal distribution

In [ ]:
output <- vector("double", ncol(df))  # 1. output
for (i in seq_along(df)) {            # 2. sequence
    output[[i]] <- median(df[[i]])    # 3. body
    }
output

[1] -0.46224620 -0.02504683  0.06491343  0.02221863

* body 내의 함수를 반복

In [ ]:
install.packages("rbenchmark")
library(rbenchmark)

simple1 <- function(n) {
    output <- vector("double", n)
    for(i in 1:n)
    output[i] = i
    return(output)
    }

simple2 <- function(n) {
    output <- c()
    for(i in 1:n)
    output = c(output, i)
    return(output)
    }

simple1(3)
simple2(3)

output1 <- vector("double", 4)
output2 <- c()
print(output1)
output2

benchmark("fc1"=simple1(1000),
          "fc2"=simple2(1000),
          replications=100,
          columns=c('test', 'elapsed', 'replications'))

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

[1] 1 2 3

[1] 1 2 3

[1] 0 0 0 0

NULL

  test elapsed replications
1 fc1  0.008   100
2 fc2  0.221   100

* 사전에 vector 저장 공간을 할당해 해당 공간에 output을 저장하는 방법이 output이 나올때마다 저장 공간을 하나하나 할당하는 방법보다 효율적이다

In [ ]:
?function()

col_mean <- function(df) {
    output <- vector("double", ncol(df))
    for (i in seq_along(df)) {
        output[[i]] <- mean(df[[i]])
        }
    output
    }
col_mean(df)

col_summary <- function(df, fun) {
    out <- vector("double", length(df))
    for (i in seq_along(df)) {
        out[i] <- fun(df[[i]])
        }
    out
    }
col_summary(df, mean)
col_summary(df, median)
col_summary(df, sd)

[1]  0.1085610 -0.3052299  0.1980162  0.1006173

[1]  0.1085610 -0.3052299  0.1980162  0.1006173

[1] -0.46224620 -0.02504683  0.06491343  0.02221863

[1] 1.2330428 0.9871966 0.9288594 1.0915158

* 응용

 * wrap up for_loops in a function
 * make function as a variable

#* functional programming __VS__ for_loops

In [ ]:
n_len = 10
gen1 <- function(n_len) {
    rep(10,n_len) %>% map(~rnorm(.))
    }

gen2 <- function(n_len) {
    df2 <- vector(mode = "list", length = n_len)
    for (i in 1:n_len)
    df2[[i]] <- rnorm(10)
    df2
    }

gen3 <- function(n_len) {
    lapply(rep(10,n_len), rnorm )
    }

benchmark("fc1"=gen1(1000),
          "fc2"=gen2(1000),
          "fc3"=gen3(1000),
          replications=100,
          columns=c('test', 'elapsed', 'replications'))

  test elapsed replications
1 fc1  0.563   100
2 fc2  0.396   100
3 fc3  0.450   100

* apply() and lapply() can be alternatives of map()
* use the one that you are familiar with
* but functional programming is memory efficient by not saving internal calculations. Easier to understand if you get used to it.